[
    {
      "Name": "Fifa 23",
      "Price": "€77.65",
      "Details": "From augmented reality broadcast replays to hyper-realistic pitch surfaces and enhanced stadium atmosphere, get an elevated matchday experience in FIFA 23 on next-gen PlaysStation platform"
    },
    {
      "Name": "Call of Duty Modern Warfare 2",
      "Price": "€57.99",
      "Details": "Squad up and fight alongside the iconic operators of Task Force 141 with the return of Modern Warfare"
    },
    {
      "Name": "God Of War Rangnarok",
      "Price": "€99.00",
      "Details": "From Santa Monica Studio comes the sequel to the critically acclaimed God of War (2018). Fimbulwinter is well underway. Kratos and Atreus must journey to each of the Nine Realms in search of answers as Asgardian forces prepare for a prophesied battle that will end the world. Along the way they will explore stunning, mythical landscapes, and face fearsome enemies in the form of Norse gods and monsters. The threat of Ragnarök grows ever closer. Kratos and Atreus must choose between their own safety and the safety of the realms"
    },
    {
      "Name": "Need for Speed Unbound",
      "Price": "€200.99",
      "Details": "With separate single and multiplayer campaigns, this latest edition in the Need for Speed franchise from Criterion Games delivers hours of electric, adrenaline-pumping racing action. Race against time, outsmart the cops, and take on weekly qualifiers to reach The Grand, Lakeshore's ultimate street racing challenge. Pack your garage with precision-tuned, custom rides and light up the streets with your style, exclusive fits, and a vibrant global soundtrack that bumps in every corner of the world"
    },
    {
      "Name": "Gran Turismo 7",
      "Price": "€149.00",
      "Details": "Whether you’re a competitive or casual racer, collector, tuner, livery designer or photographer – find your line with a staggering collection of game modes including fan-favourites like GT Campaign, Arcade and Driving School. With the reintroduction of the legendary GT Simulation Mode, buy, tune and race your way through a rewarding solo campaign as you unlock new cars and challenges. And if you love going head-to-head with others, hone your skills and compete in the GT Sport Mode"
    },
    {
      "Name": "Dirt 5",
      "Price": "€29.99",
      "Details": "DIRT 5 is the bold new off-road arcade racing experience created by Codemasters. Conquer stunning global routes and drive an iconic roster of cars. Experience a star-studded Career mode, four-player split-screen, the Playgrounds arena creator mode and much more!"
    },
    {
      "Name": "Darq",
      "Price": "€89.50",
      "Details": "DARQ tells the story of Lloyd, a boy who finds himself in the middle of a lucid nightmare. Unable to wake up, Lloyd has to face his fears and decipher the meaning of the dream"
    },
    {
      "Name": "Dying Light 2",
      "Price": "€199.99",
      "Details": "Dying Light 2 Stay Human is a 2022 survival horror game developed and published by Techland. The sequel to Dying Light Fight for survival in a post-apocalyptic open world in Dying Light 2, an FPP action game from Techland"
    },
    {
      "Name": "Returnal",
      "Price": "€399.99",
      "Details": "Brought to life by stunning visual effects, the dark beauty of the decaying world around you is packed with explosive surprises. From high stakes, bullet hell-fuelled combat, to visceral twists and turns through stark and contrasting environments. You’ll explore, discover and fight your way through an unforgiving journey, where mystery stalks your every move"
    }
  ]